Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/project_files/BnO_fs2/stm32/attachedDevices.c
/**
* @file attachedDevices.c
* @brief The devices attached to the product.
* @author Gavin Lee
* @date 26-Nov-2013
* @copyright Tymphany Ltd.
*/

#include "stm32f0xx_usart.h"
#include "deviceTypes.h"
#include "attachedDevices.h"
#include "trace.h"
#include "product.config"

#define I2C_CLK (350)
/****************************************
 * Device: Touch Keys                   *
 ****************************************/
#ifdef HAS_AZOTEQ_INTEG_TOUCHKEY_DRV
static const tGPIOPin gpioTouchPins[] =
{
    {GPIO_OUT_TCH_360_RST,      IO_PORT_C, IO_BIT_10,  GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,  ODC_DISABLE}, //PC10     
    {GPIO_IN_TCH_360_RDY,       IO_PORT_C, IO_BIT_11,  GPIO_DIGITAL_INPUT,     GPIO_ACTIVE_FLOATING,  ODC_NOT_APPLICABLE}, //PC11
    {GPIO_IN_TCH_572_RDY,       IO_PORT_C, IO_BIT_12,  GPIO_DIGITAL_INPUT,     GPIO_ACTIVE_FLOATING,  ODC_NOT_APPLICABLE}, //PC12
    {GPIO_OUT_TCH_572_RST,      IO_PORT_C, IO_BIT_8,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PC8

    /* Both touch and IO-Expender use power of this pin, thus we re-define this pin on two array.
     * When modify, remember to modify another one.
     */
    {GPIO_OUT_TCH_POWER,        IO_PORT_C, IO_BIT_9,   GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PC9
};

static const tGPIODevice gpioTouchConfig =
{
    .deviceInfo.deviceID = TOUCH_KEY_DEV_ID,
    .deviceInfo.deviceType = GPIO_DEV_TYPE,
    .usedGPIOPinNum =  ArraySize(gpioTouchPins),
    .pGPIOPinSet = gpioTouchPins
};

static const tI2CDevice i2cTouch360aConfig =
{
    .deviceInfo.deviceID = TOUCH_KEY_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C1
    .pvSlaveCallback = NULL, //not-used parameter
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0xC8, /* 8bit slave address */
};

static const tI2CDevice i2cTouch572Config =
{
    .deviceInfo.deviceID = TOUCH_KEY_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C1
    .pvSlaveCallback = NULL, //not-used parameter
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0xE8, /* 8bit slave address */
};

/* IQS572 bootloader i2c config 
 * Note i2cTouch572BlConfig can not "const", because Azoteq touch drvier
 * will modify (regAddrLen), to support bootloader command with various 
 * length of register address
 */
static /*const */tI2CDevice i2cTouch572BlConfig =
{
    .deviceInfo.deviceID = TOUCH_KEY_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C1
    .pvSlaveCallback = NULL, //not-used parameter
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0x68, /* 8bit slave address */
};

static const tAzIntegTouchKeyboardDevice touchKeyConfig =
{
    .touchKeyboard.deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .touchKeyboard.deviceInfo.deviceType = AZ_INTEG_TOUCH_KEY_DEV_TYPE,
    .touchKeyboard.keyNum = NUM_OF_AZ_INTEG_TOUCH_KEY,  // == ArraySize(azIntegTouchKey)
    .i2cConfig572= &i2cTouch572Config,
    .i2cConfig572Bl= &i2cTouch572BlConfig,
    .i2cConfig360a= &i2cTouch360aConfig,
    .gpioConfig= &gpioTouchConfig,
};
#endif /* #ifdef HAS_AZOTEQ_INTEG_TOUCHKEY_DRV */

#ifdef PT_I2C_DEBUG
static const tI2CDevice i2cDbgConfig1 =
{
    .deviceInfo.deviceID = DBG_I2C1_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C2
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_16BITS,
    .baudRate = I2C_CLK, //KHz
};
static const tI2CDevice i2cDbgConfig2 =
{
    .deviceInfo.deviceID = DBG_I2C2_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_16BITS,
    .baudRate = I2C_CLK, //KHz
};
#endif /* #ifdef PT_I2C_DEBUG */

/****************************************
 * Device: ADC Keys                     *
 ****************************************/
/**
 * keyboard object setting
 * The ADC threshold defind in our document is not correct(theoretical value),
 * It has too large difference with the real value. Below is the theoretical
 * adc threshold table and the real threshold  table
 * Theoretical threshold table (defined in our project specification):
        key_id       key_ADC_channel   adc_max_value  adc_max_value
        {VOLUME_DOWN_KEY,   ADC_CHANNEL0,   {(512-15),  (512+15)}},
        {VOLUME_UP_KEY,     ADC_CHANNEL0,   {(410-13),  (410+13)}},
        {VOL_UP_DOWN_KEY,   ADC_CHANNEL0,   {(640-18),  (640+18)}},
        {NEXT_PREV_KEY,     ADC_CHANNEL1,   {(600-17),  (600+17)}},
        {NEXT_KEY,          ADC_CHANNEL1,   {(300-10),  (300+10)}},
        {PLAY_PAUSE_KEY,    ADC_CHANNEL1,   {(410-13),  (408+13)}},
        {PREV_KEY,          ADC_CHANNEL1,   {(512-15),  (512+15)}}
 * The real threshold table is based on Ruben's idea, the adc range is enlarged
 * to handle specail case such as hardware bugs. Aparrently, the range is
 * continuous, this enables the software to, at least, "do something" if there
 * is hardware defeat which lead to an uncommon adc value. It is difficult
 * to detect the bug if the software just igonore this uncommon adc value.
 */
#define ADC_THRESHOLD_LEVEL_1   0
#define ADC_THRESHOLD_LEVEL_2   400
#define ADC_THRESHOLD_LEVEL_3   1600
#define ADC_THRESHOLD_LEVEL_4   2400
#define ADC_THRESHOLD_RANGE_FACTORY_RESET_KEY   ADC_THRESHOLD_LEVEL_1,ADC_THRESHOLD_LEVEL_2
#define ADC_THRESHOLD_RANGE_SOFT_AP_KEY         ADC_THRESHOLD_LEVEL_3,ADC_THRESHOLD_LEVEL_4

/* When add/remove items in attrADCPinsForKey[], 
 * remember to update (NUM_OF_ADC_KEY_PIN) on attachedDevices.h
 */
static const tAdcPinIoAttr attrADCPinsForKey[NUM_OF_ADC_KEY_PIN] =
{
    {ADC_FS_KEY , ADC_CHANNEL1, IO_PORT_A, IO_BIT_1}, //PA1, ADC_IN1
};

static const tADCDevice ADCConfigForKey =
{
    .ADCEnabledPinNum = NUM_OF_ADC_KEY_PIN, // == ArraySize(attrADCPinsForKey)
    .pAdcPinIoAttr = attrADCPinsForKey
};

/* When add/remove items in adcKey[], 
 * remember to update (NUM_OF_ADC_KEY) on attachedDevices.h 
 */
static const tAdcKey adcKey[NUM_OF_ADC_KEY]=
{   /* key_id         key_ADC_pin        adc threshold */
    {FACTORY_RESET_KEY,  ADC_FS_KEY ,      ADC_THRESHOLD_RANGE_FACTORY_RESET_KEY}, //adc value: 70
    {SOFT_AP_KEY,        ADC_FS_KEY ,      ADC_THRESHOLD_RANGE_SOFT_AP_KEY},       //adc value: 2068
};

