Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/project_files/BnO_fs2/stm32/attachedDevices.c
static tAdcKeyboardDevice adcKeyConfig = // const
{
    .adcKeyboard.deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .adcKeyboard.deviceInfo.deviceType = ADC_DEV_TYPE,
    .adcKeyboard.keyNum = NUM_OF_ADC_KEY,  // == ArraySize(adcKey)
    .attachedDeviceObjConfig = &ADCConfigForKey,
    .pAdcKeySet = adcKey
};

static const tGPIOPin gpioRotaterPins[] =
{
    {GPIO_IN_ROTARY_VOL_A, IO_PORT_B, IO_BIT_3, GPIO_DIGITAL_INPUT, GPIO_ACTIVE_HIGH, ODC_NOT_APPLICABLE}, //PB3
    {GPIO_IN_ROTARY_VOL_B, IO_PORT_D, IO_BIT_2, GPIO_DIGITAL_INPUT, GPIO_ACTIVE_HIGH, ODC_NOT_APPLICABLE}, //PD2
};

static const tGPIODevice gpioRotaterConfig =
{
    .deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .deviceInfo.deviceType = GPIO_DEV_TYPE,
    .usedGPIOPinNum =  ArraySize(gpioRotaterPins),
    .pGPIOPinSet = gpioRotaterPins
};

static tRotaterKeyboardDevice rotaterKeyConfig =
{
    .kbDev.deviceInfo.deviceID   = KEYBOARD_DEV_ID,
    .kbDev.deviceInfo.deviceType = ROTATER_DEV_TYPE,
    .kbDev.keyNum = 2,  // only : CW and CCW
    .gpioConfig = &gpioRotaterConfig,
    .keyCw      = VOLUME_UP_KEY,
    .keyCcw     = VOLUME_DOWN_KEY,
};


/****************************************
 * Device: ADC (not key)                *
 ****************************************/
/* When add/remove adc pins, 
 * remember to update (NUM_OF_ALL_ENABLED_ADC_PIN) on attachedDevices.h
 */
static const tAdcPinIoAttr attrAdcPowerPins[NUM_OF_ADC_POWER_PIN] =
{
    {ADC_HW_VER,        ADC_CHANNEL14,  IO_PORT_C,  IO_BIT_4},    //PC4, ADC_IN14  
};

static const tADCDevice adcPowerConfig =
{
    .deviceInfo.deviceID = POWER_DEV_ID,
    .deviceInfo.deviceType = ADC_DEV_TYPE,
    .ADCEnabledPinNum = NUM_OF_ADC_POWER_PIN, // =ArraySize(attrAdcPowerPins)
    .pAdcPinIoAttr = attrAdcPowerPins
};


/* When add/remove adc pins, 
 * remember to update (NUM_OF_ALL_ENABLED_ADC_PIN) on attachedDevices.h
 */
static const tAdcPinIoAttr attrAdcAudioPins[NUM_OF_ADC_AUDIO_PIN] =
{
    {ADC_NTC_WF_AMP_1,   ADC_CHANNEL5,   IO_PORT_A,  IO_BIT_5},  //PA5, ADC_IN5
    {ADC_NTC_WF_AMP_2,   ADC_CHANNEL6,   IO_PORT_A,  IO_BIT_6},  //PA6, ADC_IN6  
    {ADC_NTC_WF_SPK,     ADC_CHANNEL11,  IO_PORT_C,  IO_BIT_1},  //PC1, ADC_IN11
    {ADC_NTC_MID_SPK_A,  ADC_CHANNEL12,  IO_PORT_C,  IO_BIT_2},  //PC2, ADC_IN12
    {ADC_NTC_MID_SPK_B,  ADC_CHANNEL13,  IO_PORT_C,  IO_BIT_3},  //PC3, ADC_IN13
    {ADC_NTC_TW_AMP,     ADC_CHANNEL10,  IO_PORT_C,  IO_BIT_0},  //PC0, ADC_IN10
};

static const tADCDevice adcAudioConfig =
{
    .deviceInfo.deviceID = AUDIO_DEV_ID,
    .deviceInfo.deviceType = ADC_DEV_TYPE,
    .ADCEnabledPinNum = NUM_OF_ADC_AUDIO_PIN, // =ArraySize(attrAdcPowerPins)
    .pAdcPinIoAttr = attrAdcAudioPins
};



/****************************************
 * Device: GPIO Keys                     *
 ****************************************/
static const tGPIOPin gpioKeyPins[NUM_OF_GPIO_KEY_PIN] =
{
    {GPIO_IN_POWER_KEY, IO_PORT_C,  IO_BIT_14,  GPIO_DIGITAL_INPUT,  GPIO_ACTIVE_LOW,  ODC_NOT_APPLICABLE}, //PC14    
};

static const tGPIODevice GPIOKeyConfig =
{
    .usedGPIOPinNum =  NUM_OF_GPIO_KEY_PIN,
    .pGPIOPinSet = gpioKeyPins
};


/* When add/remove items in gpioKeysSet[], 
 * remember to update (NUM_OF_GPIO_KEY) on attachedDevices.h 
 */
static const tGpioKey gpioKeysSet[NUM_OF_GPIO_KEY] =
{   /* key_id           */
    {POWER_KEY,    GPIO_IN_POWER_KEY}, //PC14
};

static tGpioKeyboardDevice gpioKeyConfig =
{
    .gpioKeyboard.deviceInfo.deviceID = KEYBOARD_DEV_ID,
    .gpioKeyboard.deviceInfo.deviceType = GPIO_DEV_TYPE,
    .gpioKeyboard.keyNum = NUM_OF_GPIO_KEY, // == ArraySize(gpioKeysSet)
    .attachedDeviceObjConfig = &GPIOKeyConfig,
    .pGpioKeySet = gpioKeysSet
};



/****************************************
 * Device: Power                        *
 ****************************************/
static const tGPIOPin gpioPowerPins[] =
{
    //Normal
    {GPIO_IN_DC_IN,        IO_PORT_C,  IO_BIT_6,   GPIO_DIGITAL_INPUT,   GPIO_ACTIVE_LOW,        ODC_NOT_APPLICABLE},  //PC6  (FS1:PB15, FS2:PC6)
    {GPIO_OUT_TCH_360_RST,      IO_PORT_C, IO_BIT_10,  GPIO_DIGITAL_OUTPUT,    GPIO_DEFAULT_OUT_LOW,  ODC_DISABLE}, //PC10 
    //Note gpioTouchPins[] also have GPIO_IN_TCH_572_RDY.
    {GPIO_IN_TCH_360_RDY,       IO_PORT_C, IO_BIT_11,  GPIO_DIGITAL_INPUT,     GPIO_ACTIVE_FLOATING,  ODC_NOT_APPLICABLE}, //PC11
    {GPIO_IN_TCH_572_RDY,       IO_PORT_C, IO_BIT_12,  GPIO_DIGITAL_INPUT,     GPIO_ACTIVE_FLOATING,  ODC_NOT_APPLICABLE}, //PC12
};

static const tGPIODevice gpioPowerConfig =
{
  .deviceInfo.deviceID = POWER_DEV_ID,
  .deviceInfo.deviceType = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioPowerPins),
  .pGPIOPinSet = gpioPowerPins
};


/****************************************
 * Device: ioexpander reset ctrl         *
 ****************************************/
static const tGPIOPin gpioIoexpanderPin[] =
{
    {GPIO_OUT_IOEXP_RST,   IO_PORT_B, IO_BIT_12,  GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,    ODC_DISABLE}, //PB12

    /* Both touch and IO-Expender use power of this pin, thus we re-define this pin on two array.
     * When modify, remember to modify another one.
     */
    {GPIO_OUT_TCH_POWER,   IO_PORT_C, IO_BIT_9,   GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PC9
};

static const tGPIODevice gpioIoexpanderConfig =
{
  .deviceInfo.deviceID = IO_EXPANDER_DEV_ID,
  .deviceInfo.deviceType = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioIoexpanderPin),
  .pGPIOPinSet = gpioIoexpanderPin
};

/****************************************
 * Device: DSP                          *
 ****************************************/
static const tGPIOPin gpioDspPins[] =
{
    {GPIO_OUT_DSP_RST_N,   IO_PORT_B,  IO_BIT_2,  GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB2  
    {GPIO_OUT_BOOST_CAP,   IO_PORT_B,  IO_BIT_1,  GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB1
};
static const tGPIODevice gpioDspConfig =
{
  .deviceInfo.deviceID = DSP_DEV_ID,
  .deviceInfo.deviceType = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioDspPins),
  .pGPIOPinSet = gpioDspPins
};


