Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/project_files/BnO_fs2/stm32/attachedDevices.c
static const tI2CDevice i2cDspConfig =
{
    .deviceInfo.deviceID = DSP_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_16BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0x70,
};



/****************************************
 * Device: AMP TAS5760                  *
 ****************************************/
static const tI2CDevice i2cAmpWoofer1Config = //Woofer Amplifier 1
{
    .deviceInfo.deviceID = AMP_WOOFER_1_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0xDA,
};

static const tI2CDevice i2cAmpWoofer2Config = //Woofer Amplifier 2
{
    .deviceInfo.deviceID = AMP_WOOFER_2_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_TWO, //I2C2
    .pvSlaveCallback = NULL,
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0xD8,
};

static const tI2CDevice i2cAmpMidConfig = //Middle Amplifier
{
    .deviceInfo.deviceID = AMP_MIDDLE_1_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C1
    .pvSlaveCallback = NULL,
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0xDA,
};

static const tI2CDevice i2cAmpTweeterConfig = //Tweeter Amplifier
{
    .deviceInfo.deviceID = AMP_TWEETER_1_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C1
    .pvSlaveCallback = NULL,
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0xD8,
};




/****************************************
 * Device: Audio                        *
 ****************************************/
static const tGPIOPin gpioAudioPins[] =
{
    {GPIO_IN_DSP_TUNE,     IO_PORT_A,  IO_BIT_15, GPIO_DIGITAL_INPUT,   GPIO_ACTIVE_HIGH,       ODC_NOT_APPLICABLE}, //PA15
    {GPIO_OUT_SYSPWR_ON,   IO_PORT_B,  IO_BIT_0,  GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB0
    {GPIO_IN_AMP_FAULTZ,   IO_PORT_B,  IO_BIT_14, GPIO_DIGITAL_INPUT,   GPIO_ACTIVE_LOW,        ODC_NOT_APPLICABLE},  //PB14. SPK_FAULT is open drain, MCU need to week pull low
    {GPIO_OUT_AMP_SDZ,     IO_PORT_B,  IO_BIT_13, GPIO_DIGITAL_OUTPUT,  GPIO_DEFAULT_OUT_LOW,   ODC_DISABLE}, //PB13
};
static const tGPIODevice gpioAudioConfig =
{
  .deviceInfo.deviceID    = AUDIO_DEV_ID,
  .deviceInfo.deviceType  = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioAudioPins),
  .pGPIOPinSet = gpioAudioPins
};



/****************************************
 * Device: ASE-TK                       *
 ****************************************/
static const tGPIOPin gpioAsetkPins[] =
{
    /* GPIO_OUT_BOOT_STATUS_SW should defaultly pull low, because
     *   Normal condition: pull low
     *   Before jump to ST-BL: pull high
     */
    {GPIO_OUT_BOOT_STATUS_SW,   IO_PORT_B,  IO_BIT_8,  GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_LOW,  ODC_DISABLE}, //PB8
    {GPIO_OUT_ASE_RST_N,        IO_PORT_A,  IO_BIT_11, GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PA11
    {GPIO_OUT_ASE_SYS_EN,       IO_PORT_A,  IO_BIT_12, GPIO_DIGITAL_OUTPUT, GPIO_DEFAULT_OUT_HIGH, ODC_DISABLE}, //PA12
    {GPIO_IN_ASE_REQ_PDN,       IO_PORT_A,  IO_BIT_8,  GPIO_DIGITAL_INPUT,  GPIO_ACTIVE_HIGH,          ODC_NOT_APPLICABLE},  //PA8 
};
static const tGPIODevice gpioAsetkConfig =
{
  .deviceInfo.deviceID    = ASETK_DEV_ID,
  .deviceInfo.deviceType  = GPIO_DEV_TYPE,
  .usedGPIOPinNum =  ArraySize(gpioAsetkPins),
  .pGPIOPinSet = gpioAsetkPins
};


static const tUARTDevice uartAsetkConfig = {
    .deviceInfo.deviceID    = ASETK_DEV_ID,
    .deviceInfo.deviceType  = UART_DEV_TYPE,
    .baudrate   = 115200,
    .uartId     = TP_UART_DEV_1, //PA9, PA10
    .byteSize   = TP_UART_BYTE_SIZE_9_BITS,
    .parity     = TP_UART_PARITY_EVEN,
    .stopBits   = TP_UART_STOP_BIT_1,
    .dmaEnable  = FALSE,
    .interrupt.priority    = 0,
    .interrupt.subPriority = 0,     // not-used, for compatibility with PIC32
};



/****************************************
 * Device: LED                         *
 ****************************************/
static const tIoExpanderLedMap ioeLedMap[] =
{ // ledID             pure_color    port   pin
    {LED_CONN_WHT,    WHITE,     0,    0}, // IO-Expander OUT0
    {LED_CONN_BLUE,   BLUE,      0,    1}, // IO-Expander OUT1
    {LED_CONN_ORG,    ORANGE,    0,    2}, // IO-Expander OUT2
    {LED_CONN_RED,    RED,       0,    3}, // IO-Expander OUT3
    {LED_PROD_RED,    RED,       0,    4}, // IO-Expander OUT4
    {LED_PROD_WHT,    WHITE,     0,    5}, // IO-Expander OUT5
};

static const tI2CDevice  ioExpanderi2cDeviceConf =
{
    .deviceInfo.deviceID= IO_EXPANDER_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode            = I2C_MASTER_MODE,
    .channel            = I2C_CHANNEL_ONE,  // I2C1
    .pvSlaveCallback    = NULL,
    .regAddrLen         = REG_LEN_8BITS,
    .baudRate           = I2C_CLK,      //KHz
    .devAddress         = 0xB6,
};

static const tIoeLedDevice ledConfig = {
    .deviceInfo.deviceID    = LED_DEV_ID,
    .deviceInfo.deviceType  = I2C_DEV_TYPE,
    .ledNum                 = ArraySize(ioeLedMap),
    .pIoExpanderLedMap      = ioeLedMap,
    .i2cDeviceConf = &ioExpanderi2cDeviceConf,
};




/****************************************
 * Device: ADC: PCM1862                 *
 ****************************************/
static const tI2CDevice i2cAdcConfig =
{
    .deviceInfo.deviceID = AUDIO_ADC_DEV_ID,
    .deviceInfo.deviceType = I2C_DEV_TYPE,
    .i2cMode = I2C_MASTER_MODE,
    .channel = I2C_CHANNEL_ONE, //I2C1
    .pvSlaveCallback = NULL,  //not-used parameter
    .regAddrLen = REG_LEN_8BITS,
    .baudRate = I2C_CLK, //KHz
    .devAddress = 0x94, //MD1 is hardware pull low, thus I2C address is 0x94
};



/****************************************
 * Device: Debug                        *
 ****************************************/
#ifdef HAS_DEBUG
static const tUARTDevice uartDebugConfig = {
    .deviceInfo.deviceID    = DEBUG_DEV_ID,
    .deviceInfo.deviceType  = UART_DEV_TYPE,
    .baudrate   = 115200,
    .uartId     = TP_UART_DEV_2, //PA2, PA3
    .byteSize   = TP_UART_BYTE_SIZE_8_BITS,
    .parity     = TP_UART_PARITY_NONE,
    .stopBits   = TP_UART_STOP_BIT_1,
    .dmaEnable  = FALSE,
    .interrupt.priority    = 0,
    .interrupt.subPriority = 0,     // not-used, for compatibility with PIC32
};
#endif




/****************************************
 * Device: NVM                          *
 ****************************************/
const tStorageDevice nvmConfig = {
    .deviceInfo.deviceID    = INT_FLASH_DEV_ID,
    .deviceInfo.deviceType  = NVM_DEV_TYPE,
};




/****************************************
 * Device list                          *
 ****************************************/
const tDevice * const devices[] =
{
    //ASE-TK
    (tDevice*)&uartAsetkConfig,
    (tDevice*)&gpioAsetkConfig, 

    //KEY
    (tDevice*)&adcKeyConfig,
    (tDevice*)&gpioKeyConfig,
#ifdef HAS_AZOTEQ_INTEG_TOUCHKEY_DRV    
    (tDevice*)&touchKeyConfig,    
#endif    
    (tDevice*)&rotaterKeyConfig,

    //POWER
    (tDevice*)&gpioPowerConfig,
    (tDevice*)&adcPowerConfig,
    
